[
  { "term": "Ask Price", "definition": "The price at which you can buy a currency pair. Also called the offer price. Always higher than the bid price." },
  { "term": "ATR", "definition": "Average True Range - an indicator measuring market volatility by calculating average price range over a period." },
  { "term": "Base Currency", "definition": "The first currency in a currency pair. In EUR/USD, EUR is the base currency." },
  { "term": "Bear Market", "definition": "A market characterized by falling prices and pessimistic sentiment." },
  { "term": "Bearish", "definition": "Expecting prices to fall. A bearish trader anticipates downward movement." },
  { "term": "Bid Price", "definition": "The price at which you can sell a currency pair. Always lower than the ask price." },
  { "term": "Bollinger Bands", "definition": "A volatility indicator consisting of a moving average with upper and lower bands based on standard deviations." },
  { "term": "Breakout", "definition": "When price moves above resistance or below support, potentially starting a new trend." },
  { "term": "Broker", "definition": "A firm or individual that executes buy and sell orders on behalf of traders." },
  { "term": "Bull Market", "definition": "A market characterized by rising prices and optimistic sentiment." },
  { "term": "Bullish", "definition": "Expecting prices to rise. A bullish trader anticipates upward movement." },
  { "term": "Cable", "definition": "Slang term for the GBP/USD currency pair, referring to the transatlantic telegraph cable." },
  { "term": "Candlestick", "definition": "A chart type showing open, high, low, and close prices with a body and wicks." },
  { "term": "Carry Trade", "definition": "Borrowing a low-interest currency to buy a high-interest currency to profit from the rate differential." },
  { "term": "Central Bank", "definition": "National institution controlling monetary policy, like the Federal Reserve or European Central Bank." },
  { "term": "Consolidation", "definition": "A period when price moves sideways within a range, showing market indecision." },
  { "term": "CPI", "definition": "Consumer Price Index - measures inflation by tracking price changes in consumer goods and services." },
  { "term": "Cross Rate", "definition": "A currency pair that doesn't include the US Dollar, like EUR/GBP or AUD/JPY." },
  { "term": "Day Trading", "definition": "Opening and closing all positions within the same trading day, not holding overnight." },
  { "term": "Demo Account", "definition": "A practice account with virtual money for testing strategies without real risk." },
  { "term": "Divergence", "definition": "When price and an indicator move in opposite directions, potentially signaling a reversal." },
  { "term": "Doji", "definition": "A candlestick with nearly equal open and close, showing market indecision." },
  { "term": "Dovish", "definition": "Central bank policy focused on growth and employment, typically involving low rates or stimulus." },
  { "term": "Drawdown", "definition": "The decline from a peak to a trough in account equity, measured as a percentage." },
  { "term": "ECN", "definition": "Electronic Communication Network - provides direct market access without a dealing desk." },
  { "term": "EMA", "definition": "Exponential Moving Average - gives more weight to recent prices, making it more responsive than SMA." },
  { "term": "Equity", "definition": "Your account balance plus or minus any unrealized profit or loss from open positions." },
  { "term": "Exotic Pair", "definition": "A currency pair combining a major currency with an emerging market currency, like USD/TRY." },
  { "term": "Fibonacci Retracement", "definition": "Tool identifying potential support/resistance levels based on Fibonacci ratios (38.2%, 50%, 61.8%)." },
  { "term": "Fill", "definition": "The execution of an order at a specific price." },
  { "term": "Flat", "definition": "Having no open positions. Also called being square." },
  { "term": "Forex", "definition": "Foreign Exchange - the global market for trading currencies, operating 24/5." },
  { "term": "Forward Guidance", "definition": "Central bank communication about future monetary policy intentions." },
  { "term": "Fundamental Analysis", "definition": "Analyzing economic factors, news, and events to predict currency movements." },
  { "term": "Gap", "definition": "A price level that wasn't traded, appearing as a space on charts, often after weekends or news." },
  { "term": "GDP", "definition": "Gross Domestic Product - measures total economic output of a country." },
  { "term": "Going Long", "definition": "Buying a currency pair with expectation of price increase." },
  { "term": "Going Short", "definition": "Selling a currency pair with expectation of price decrease." },
  { "term": "Golden Cross", "definition": "When the 50-period MA crosses above the 200-period MA, signaling potential bullish trend." },
  { "term": "Hammer", "definition": "Bullish reversal candlestick with long lower wick and small body near the top." },
  { "term": "Hawkish", "definition": "Central bank policy focused on fighting inflation, typically involving rate hikes." },
  { "term": "Hedge", "definition": "Taking a position to offset risk in another position." },
  { "term": "Interbank Market", "definition": "The market where banks trade currencies with each other, forming the basis of forex pricing." },
  { "term": "Interest Rate", "definition": "The cost of borrowing money, set by central banks, heavily influencing currency values." },
  { "term": "Intraday", "definition": "Occurring within a single trading day." },
  { "term": "Leverage", "definition": "The ability to control large positions with small capital, expressed as a ratio like 100:1." },
  { "term": "Limit Order", "definition": "An order to buy below current price or sell above current price at a specified level." },
  { "term": "Liquidity", "definition": "The ease of buying/selling an asset without significantly affecting its price." },
  { "term": "Long Position", "definition": "A trade where you've bought a currency pair, profiting from price increases." },
  { "term": "Lot", "definition": "A standardized unit of currency. Standard lot = 100,000 units, mini = 10,000, micro = 1,000." },
  { "term": "MACD", "definition": "Moving Average Convergence Divergence - momentum indicator showing relationship between two MAs." },
  { "term": "Major Pairs", "definition": "The most traded currency pairs, all including USD: EUR/USD, GBP/USD, USD/JPY, USD/CHF." },
  { "term": "Margin", "definition": "The amount of capital required to open and maintain a leveraged position." },
  { "term": "Margin Call", "definition": "When account equity falls below required margin, broker may close positions." },
  { "term": "Market Order", "definition": "An order to buy or sell immediately at the current market price." },
  { "term": "Moving Average", "definition": "An indicator that smooths price data by calculating average price over a specific period." },
  { "term": "NFP", "definition": "Non-Farm Payrolls - monthly US employment report, highly market-moving for USD." },
  { "term": "Order", "definition": "An instruction to execute a trade at specified conditions." },
  { "term": "Overnight Position", "definition": "A trade held past the daily market close, subject to swap/rollover charges." },
  { "term": "Overbought", "definition": "Market condition where price has risen sharply and may be due for a pullback. RSI above 70." },
  { "term": "Oversold", "definition": "Market condition where price has fallen sharply and may be due for a bounce. RSI below 30." },
  { "term": "Pending Order", "definition": "An order that executes automatically when price reaches a specified level." },
  { "term": "Pip", "definition": "Percentage in Point - the smallest price movement, typically 0.0001 for most pairs, 0.01 for JPY." },
  { "term": "Pivot Point", "definition": "A technical level calculated from previous period's high, low, close, used for support/resistance." },
  { "term": "PMI", "definition": "Purchasing Managers' Index - measures manufacturing and services sector health." },
  { "term": "Position", "definition": "An open trade that will profit or lose as the market moves." },
  { "term": "Position Sizing", "definition": "Calculating the appropriate lot size based on risk tolerance and stop loss distance." },
  { "term": "Price Action", "definition": "Trading based on raw price movement and patterns rather than indicators." },
  { "term": "Profit Target", "definition": "A predetermined price level where you'll close a trade to take profits." },
  { "term": "QE", "definition": "Quantitative Easing - central bank buying assets to inject money and stimulate economy." },
  { "term": "Quote Currency", "definition": "The second currency in a pair. In EUR/USD, USD is the quote currency." },
  { "term": "Rally", "definition": "A sustained increase in price." },
  { "term": "Range", "definition": "A market moving sideways between support and resistance without clear trend." },
  { "term": "Resistance", "definition": "A price level where selling pressure prevents further upward movement." },
  { "term": "Retracement", "definition": "A temporary price reversal within a larger trend." },
  { "term": "Reversal", "definition": "A change in price direction from uptrend to downtrend or vice versa." },
  { "term": "Risk Management", "definition": "Strategies to limit losses and protect capital, including position sizing and stop losses." },
  { "term": "Risk-Off", "definition": "Market sentiment where investors flee to safe havens due to fear or uncertainty." },
  { "term": "Risk-On", "definition": "Market sentiment where investors seek higher returns in riskier assets." },
  { "term": "Risk-Reward Ratio", "definition": "The ratio of potential profit to potential loss in a trade, like 1:2 or 1:3." },
  { "term": "Rollover", "definition": "Interest paid or earned for holding a position overnight, based on rate differential." },
  { "term": "RSI", "definition": "Relative Strength Index - oscillator measuring momentum, ranging from 0 to 100." },
  { "term": "Safe Haven", "definition": "Currencies that strengthen during uncertainty: USD, JPY, CHF." },
  { "term": "Scalping", "definition": "A strategy making many small profits from tiny price movements, holding for seconds/minutes." },
  { "term": "Session", "definition": "A major trading period: Asian (Tokyo), European (London), or American (New York)." },
  { "term": "Short Position", "definition": "A trade where you've sold a currency pair, profiting from price decreases." },
  { "term": "Slippage", "definition": "The difference between expected and actual execution price, common during volatility." },
  { "term": "SMA", "definition": "Simple Moving Average - calculates average price giving equal weight to all periods." },
  { "term": "Spread", "definition": "The difference between bid and ask price, representing broker's profit." },
  { "term": "Stop Loss", "definition": "A predetermined level to exit a losing trade, limiting potential loss." },
  { "term": "Stop Order", "definition": "An order to buy above current price or sell below current price, used for breakouts." },
  { "term": "Support", "definition": "A price level where buying interest prevents further downward movement." },
  { "term": "Swap", "definition": "Interest paid or earned for holding overnight positions. Same as rollover." },
  { "term": "Swing Trading", "definition": "Holding positions for days to weeks to capture larger price moves." },
  { "term": "Take Profit", "definition": "An order that automatically closes your position at a predetermined profit level." },
  { "term": "Technical Analysis", "definition": "Analyzing historical price patterns and indicators to forecast future movements." },
  { "term": "Tick", "definition": "A single price movement, either up or down." },
  { "term": "Trailing Stop", "definition": "A stop loss that moves automatically as price moves in your favor, locking in profit." },
  { "term": "Trend", "definition": "The general direction of price movement: uptrend, downtrend, or sideways." },
  { "term": "Trendline", "definition": "A line connecting swing highs or lows to visualize trend direction." },
  { "term": "Volatility", "definition": "The degree of price fluctuation. High volatility means large swings, low means stable." },
  { "term": "Volume", "definition": "The number of contracts or lots traded during a period." },
  { "term": "Whipsaw", "definition": "When price makes sharp movements in both directions, triggering stops before resuming trend." },
  { "term": "Wick", "definition": "The thin lines above and below a candlestick body, showing high and low prices." },
  { "term": "Accumulation", "definition": "A period where large traders are buying, typically at support, before an uptrend." },
  { "term": "Arbitrage", "definition": "Simultaneously buying and selling to profit from price differences in different markets." },
  { "term": "Bar Chart", "definition": "Chart type showing open, high, low, close with vertical bars and horizontal ticks." },
  { "term": "Basis Point", "definition": "One hundredth of a percentage point (0.01%). Used for interest rate changes." },
  { "term": "Bearish Engulfing", "definition": "A two-candle reversal pattern where bearish candle completely engulfs previous bullish candle." },
  { "term": "Bid-Ask Spread", "definition": "The difference between highest buying price and lowest selling price." },
  { "term": "Breakeven", "definition": "When a trade's current price equals entry price, resulting in zero profit or loss." },
  { "term": "Bullish Engulfing", "definition": "A two-candle reversal pattern where bullish candle completely engulfs previous bearish candle." },
  { "term": "Buy Limit", "definition": "An order to buy at a specified price below current market, anticipating a pullback." },
  { "term": "Buy Stop", "definition": "An order to buy at a specified price above current market, anticipating a breakout." },
  { "term": "Channel", "definition": "Parallel trendlines containing price movement, with support below and resistance above." },
  { "term": "Choppy Market", "definition": "A market with irregular price movements lacking clear direction." },
  { "term": "Close", "definition": "The final price of a trading period, or the act of exiting a position." },
  { "term": "Commission", "definition": "A fee charged by brokers for executing trades, separate from the spread." },
  { "term": "Correlation", "definition": "Statistical relationship between two currency pairs. Can be positive or negative." },
  { "term": "Counter Currency", "definition": "Another term for the quote currency in a currency pair." },
  { "term": "Currency Pair", "definition": "Two currencies traded against each other, like EUR/USD or GBP/JPY." },
  { "term": "Death Cross", "definition": "When 50-period MA crosses below 200-period MA, signaling potential bearish trend." },
  { "term": "Dealing Desk", "definition": "A broker model where the broker acts as market maker and may trade against clients." },
  { "term": "Distribution", "definition": "A period where large traders are selling, typically at resistance, before a downtrend." },
  { "term": "Double Bottom", "definition": "Bullish reversal pattern with two lows at similar levels, signaling upward movement." },
  { "term": "Double Top", "definition": "Bearish reversal pattern with two peaks at similar levels, signaling downward movement." },
  { "term": "Downtrend", "definition": "A series of lower highs and lower lows, indicating bearish market direction." },
  { "term": "Entry Point", "definition": "The price level at which you enter a trade." },
  { "term": "Exit Point", "definition": "The price level at which you close a trade, either at profit target or stop loss." },
  { "term": "Exponential Moving Average", "definition": "Moving average giving more weight to recent prices for faster response to changes." },
  { "term": "False Breakout", "definition": "When price briefly breaks support/resistance but quickly reverses, trapping traders." },
  { "term": "Fast Market", "definition": "Conditions of extreme volatility where prices move rapidly and execution may be delayed." },
  { "term": "Fed", "definition": "Federal Reserve - the central bank of the United States." },
  { "term": "Flag", "definition": "A continuation pattern resembling a flag, showing brief consolidation before trend resumes." },
  { "term": "Floating Profit/Loss", "definition": "Unrealized profit or loss on open positions, changing with price movement." },
  { "term": "Force Index", "definition": "An indicator combining price change and volume to measure buying/selling pressure." },
  { "term": "Free Margin", "definition": "The amount of capital available to open new positions." }
]
